Repository: EidemE/Hevy_Dashboard_App
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Exercises
fr: Exercices

source: Import
fr: Importer

source: Monthly Stats
fr: Stats mensuelles

source: Top Exercises
fr: Top Exercices

source: See all
fr: Voir tout

# noExercise
source: No exercises
fr: Aucun exercice

# noExerciseDesc
source: Import your CSV data to get started
fr: Importez vos données CSV pour commencer

source: Workouts completed
fr: Entraînements effectués

source: Different exercises
fr: Exercices différents

source: Sets completed
fr: Sets effectués

# totalWeight
source: Total weight lifted
fr: Poids total soulevé

source: Sessions
fr: Séances

source: Last
fr: Dernier

source: Today
fr: Aujourd'hui

source: Yesterday
fr: Hier

# repsProgressionTitle
source: Reps progression
fr: Progression des répétitions

# weightRepsProgressionTitle
source: Weight & reps progression
fr: Progression poids & reps

# maxWeightProgressionTitle
source: Max weight progression
fr: Progression du poids maximum

source: All exercises
fr: Tous les exercices

source: All exercises ({count})
fr: Tous les exercices ({count})

source: Change sorting
fr: Changer le tri

# sortByWorkouts
source: Number of sessions
fr: Nombre de séances

# sortBySets
source: Number of sets
fr: Nombre de sets

# sortByMaxWeight
source: Maximum weight
fr: Poids maximum

# sortByTotalWeight
source: Total weight
fr: Poids total

# sortByName
source: Name
fr: Nom

# sortLabelWorkouts
source: By sessions
fr: Par séances

# sortLabelSets
source: By sets
fr: Par sets

# sortLabelWeight
source: By weight
fr: Par poids

# sortLabelTotal
source: By total
fr: Par total

# sortLabelName
source: By name
fr: Par nom

source: Search exercises...
fr: Rechercher un exercice...

source: No exercises found
fr: Aucun exercice trouvé

# noExercisesFoundDesc
source: Try modifying your search
fr: Essayez de modifier votre recherche

# importData
source: Import my data
fr: Importer mes données

# importDataDesc
source: Import your CSV file exported from Hevy
fr: Importez votre fichier CSV exporté depuis Hevy

source: Select file
fr: Sélectionner un fichier

source: Import in progress...
fr: Import en cours...

# importSuccess
source: Import successful!
fr: Import réussi !

# importSuccessDesc
source: {count} workouts imported
fr: {count} séances importées

source: Import error
fr: Erreur d'import

source: Data already imported
fr: Données déjà importées

# dataAlreadyImportedDesc
source: Do you want to reimport?
fr: Voulez-vous réimporter ?

source: Reimport
fr: Réimporter

source: Cancel
fr: Annuler

# monthlyStatsTitle
source: Monthly statistics
fr: Statistiques mensuelles

# monthlyStatsDesc
source: Evolution of your performance over the months
fr: Évolution de vos performances à travers les mois

source: No data
fr: Aucune donnée

# noDataDesc
source: Import your CSV data to see your statistics
fr: Importez vos données CSV pour voir vos statistiques

source: No session
fr: Aucune séance

source: Total time
fr: Temps total

source: Avg. time
fr: Temps moy.

# differentExercisesShort
source: Diff. exercises
fr: Exercices diff.

# exercisesPerSession
source: Ex./session
fr: Exo./séance

# avgWeightPerSession
source: Avg. weight/session
fr: Poids moy./séance

source: All
fr: Toutes

source: Info
fr: Infos

source: Open Hevy
fr: Ouvrir Hevy

# cannotOpenHevy
source: Cannot open Hevy application
fr: Impossible d'ouvrir l'application Hevy

# globalStats
source: Global statistics
fr: Statistiques globales

source: Activity
fr: Activité

# performance30Days
source: Performance (last 30 days)
fr: Performance (30 derniers jours)

source: See more
fr: Voir plus

source: Clear
fr: Effacer

# howToImportHevy
source: How to import your Hevy data
fr: Comment importer vos données Hevy

source: Hide instructions
fr: Masquer les instructions

# importInstructions
source: To analyze your workouts, you need to export your data from the Hevy application:
fr: Pour analyser vos entraînements, vous devez exporter vos données depuis l'application Hevy :

# step1
source: Open the Hevy app on your phone
fr: Ouvrez l'application Hevy sur votre téléphone

# step2
source: Go to Profile > Settings
fr: Allez dans Profil > Paramètres

# step3
source: Select "Export and import data"
fr: Sélectionnez "Exporter et importer des données"

# step4
source: Tap "Export data"
fr: Appuyez sur "Exporter les données"

# step5
source: Choose "Export workouts"
fr: Choisissez "Exporter les entraînements"

source: Two ways to import
fr: Deux façons d'importer

# importWay1
source: • Click "Import CSV" above and select the file
fr: • Cliquez sur "Importer CSV" ci-dessus et sélectionnez le fichier

# importWay2
source: • Share the CSV file directly from Hevy to this application
fr: • Partagez directement le fichier CSV depuis Hevy vers cette application

source: No data imported
fr: Aucune donnée importée

# clickToStart
source: Click "Import CSV" to start
fr: Cliquez sur "Importer CSV" pour commencer

# confirmClear
source: Are you sure you want to clear all imported data?
fr: Êtes-vous sûr de vouloir effacer toutes les données importées ?

# workoutsImported
source: {count} workout(s) imported
fr: {count} entraînement(s) importé(s)

# importedOn
source: Imported on {date}
fr: Importé(s) le {date}

source: Evolution
fr: Évolution

source: Close
fr: Fermer

# viewOnGithub
source: View the GitHub page
fr: Voir la page GitHub

# infoDialogDescription1
source: Hevy Dashboard is an app that turns your Hevy workout exports into a clean, interactive statistics dashboard. Import your Hevy CSV and explore your training history, trends, and progress in one place.
fr: Hevy Dashboard est une application qui transforme vos exports d'entraînement Hevy en un tableau de bord de statistiques clair et interactif. Importez votre CSV Hevy et explorez votre historique, vos tendances et vos progrès en un seul endroit.

# infoDialogDescription2
source: This app is open-source under MIT licence and is not official or affiliated with Hevy Studios.
fr: Cette application est open-source sous licence MIT et n'est ni officielle ni affiliée à Hevy Studios.

# infoDialogDisclaimer
source: You can use the GitHub page to propose changes, improvements, and report bugs.
fr: Vous pouvez sur la page GitHub proposer des modifications, des améliorations et signaler des bugs avec l'application.

# routeNotFound
source: Route not found: {name}
fr: Route non trouvée : {name}

# sessionCount
source: {count, plural, one{# session} other{# sessions}}
fr: {count, plural, one{# séance} other{# séances}}

# exerciseCount
source: {count, plural, one{# exercise} other{# exercises}}
fr: {count, plural, one{# exercice} other{# exercices}}
